app/Controllers/SuperAdmin/Commissions.php

SELECT `commissions`.*, `u1`.`name` as `sponsor_name`, `u2`.`name` as `from_name`
FROM `commissions`
LEFT JOIN `users` `u1` ON `u1`.`id` = `commissions`.`sponsor_id`
LEFT JOIN `users` `u2` ON `u2`.`id` = `commissions`.`from_user_id`
---
    public function index()
    {
        $model = new CommissionModel();

        $data['commissions'] = $model
            ->select('
                commissions.*,
                u1.name as sponsor_name,
                u2.name as from_name
            ')
            ->join('users u1', 'u1.id = commissions.sponsor_id', 'left')
            ->join('users u2', 'u2.id = commissions.from_user_id', 'left')
            ->findAll();