app/Controllers/SuperAdmin/Dashboard.php

    public function index()
    {
        $userModel = new UserModel();
        $ticketModel = new TicketModel();
        $purchaseModel = new PurchaseModel();
        $commissionModel = new CommissionModel();

        $data['totalUsers'] = $userModel->countAll();
        $data['totalTickets'] = $ticketModel->countAll();

        $data['totalSales'] = $purchaseModel
            ->selectSum('price')
            ->first()['price'] ?? 0;

        $data['totalCommission'] = $commissionModel
            ->selectSum('amount')
            ->first()['amount'] ?? 0;

        // 👇 IMPORTANT: commissions for your table
        $data['commissions'] = $commissionModel
            ->orderBy('id','DESC')
            ->findAll();

        // 👇 IMPORTANT: tickets for your table
        $data['tickets'] = $ticketModel->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT SUM(`price`) AS `price`
FROM `purchases`
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `commissions`
 LIMIT 1
SELECT *
FROM `commissions`
ORDER BY `id` DESC
SELECT *
FROM `tickets`