app/Controllers/SuperAdmin/Tickets.php

SELECT *
FROM `tickets`
---
    public function index()
    {
        $data['tickets'] = $this->ticketModel->findAll();