app/Controllers/Admin.php

    public function doLogin()
    {
        $model    = new UserModel();
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $admin = $model
            ->where('email', $email)
            ->where('role', 1) // 1 = ADMIN ONLY
            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `role` = 1
 LIMIT 1

public function dashboard()
{
    if (!session()->get('isAdmin')) {
        return redirect()->to('/admin/login');
    }

    $userModel       = new UserModel();
    $commissionModel = new CommissionModel();
    $ticketModel     = new TicketModel();

    $data['totalUsers']      = $userModel->countAll();
    $data['totalWallet']     = $userModel->selectSum('wallet')->first()['wallet'] ?? 0;
    $data['totalCommission'] = $commissionModel->selectSum('amount')->first()['amount'] ?? 0;

    $view = $this->request->getGet('view') ?? 'summary';
    $data['view'] = $view;

    // === USERS ===
  if ($view == 'users') {

    $data['users'] = $userModel
        ->select('users.*, s.name as sponsor_name,
                 (SELECT COUNT(*) FROM users u2 WHERE u2.sponsor_id = users.id) as ref_count')
        ->join('users s', 's.id = users.sponsor_id', 'left')
        ->orderBy('users.id', 'DESC')
        ->findAll();
}
    // === COMMISSIONS ===
    elseif ($view == 'commissions') {
        $data['commissions'] = $commissionModel
            ->select('commissions.*, s.name as sponsor_name, u.name as buyer_name')
            ->join('users s', 's.id = commissions.sponsor_id')
            ->join('users u', 'u.id = commissions.from_user_id')
            ->orderBy('commissions.id', 'DESC')
            ->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `users`
SELECT SUM(`wallet`) AS `wallet`
FROM `users`
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `commissions`
 LIMIT 1
SELECT `users`.*, `s`.`name` as `sponsor_name`, (SELECT COUNT(*) FROM users u2 WHERE u2.sponsor_id = users.id) as ref_count
FROM `users`
LEFT JOIN `users` `s` ON `s`.`id` = `users`.`sponsor_id`
ORDER BY `users`.`id` DESC
SELECT `commissions`.*, `s`.`name` as `sponsor_name`, `u`.`name` as `buyer_name`
FROM `commissions`
JOIN `users` `s` ON `s`.`id` = `commissions`.`sponsor_id`
JOIN `users` `u` ON `u`.`id` = `commissions`.`from_user_id`
ORDER BY `commissions`.`id` DESC

        }

        // Fetch all tickets for display
        $data['tickets'] = $ticketModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `tickets`
ORDER BY `id` DESC

public function getTicket()
{
    $id = $this->request->getPost('id');
    $ticketModel = new TicketModel();

    return $this->response->setJSON($ticketModel->find($id));
---
SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '9'

public function deleteTicketAjax()
{
    $id = $this->request->getPost('id');
    $ticketModel = new TicketModel();
    $ticketModel->delete($id);
---
DELETE FROM `tickets`
WHERE `id` IN ('7')