app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'navodya@gmail.com'
 LIMIT 1
---
    public function doLogin()
    {
        $model    = new UserModel();
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();