app/Controllers/Auth.php

 public function register()
{
    $ref = $this->request->getGet('ref');

    if ($ref && is_numeric($ref)) {

        // Check if ref user exists
        $userModel = new UserModel();
        $refUser   = $userModel->find($ref);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '37'

    public function doLogin()
    {
        $model    = new UserModel();
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'A@gmail.com'
 LIMIT 1

    public function registerSave()
{
    $userModel = new UserModel();

    $name     = $this->request->getPost('name');
    $email    = $this->request->getPost('email');
    $password = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);

    if ($userModel->where('email', $email)->first()) {
        return redirect()->back()->with('error', 'Email already registered');
    }

    // ✅ Get sponsor from session (URL ref)
    $sponsor_id = session()->get('referral_id');

    if ($sponsor_id && !$userModel->find($sponsor_id)) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'