app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('logged')) {
            return redirect()->to('/login');
        }

        $userModel   = new UserModel();
        $ticketModel = new TicketModel();

        $user = $userModel->find(session()->get('id'));

        $data = [
            'name'    => $user['name'],
            'role'    => $user['role'],
            'wallet'  => $user['wallet'],
            'tickets' => $ticketModel->orderBy('id','DESC')->findAll()
        ];
---
SELECT *
FROM `users`
WHERE `users`.`id` = '42'
SELECT *
FROM `users`
WHERE `users`.`id` = '21'
SELECT *
FROM `tickets`
ORDER BY `id` DESC

    public function purchaseTicket()
{
    if (!session()->get('logged')) {
        return redirect()->to('/login');
    }

    $userModel       = new UserModel();
    $ticketModel     = new TicketModel();
    $commissionModel = new CommissionModel();
    $db              = \Config\Database::connect();

    $userId   = session()->get('id');
    $ticketId = (int)$this->request->getPost('ticket_id');

    // -----------------------------
    // VALIDATION
    // -----------------------------
    if (!$ticketId) {
        return redirect()->back()->with('error', 'Invalid Ticket.');
    }

    $user = $userModel->find($userId);

    // User deleted while logged in
    if (!$user) {
        session()->destroy();
        return redirect()->to('/login')->with('error', 'User no longer exists.');
    }

    $ticket = $ticketModel->find($ticketId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '42'
SELECT *
FROM `tickets`
WHERE `tickets`.`id` = 6

    $db->transStart();

    // Lock ticket row (avoid double purchase)
    $ticket = $db->table('tickets')
        ->where('id', $ticketId)
        ->get()
        ->getRowArray();
---
SELECT *
FROM `tickets`
WHERE `id` = 6

    // ===== LEVEL 1 =====
    if (!empty($user['sponsor_id'])) {

        $level1 = $userModel->find($user['sponsor_id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '41'

            $level1Commission = $amount * 0.10;
            $userShare -= $level1Commission;

            $userModel->update($level1['id'], [
                'wallet' => $level1['wallet'] + $level1Commission
            ]);
---
UPDATE `users` SET `wallet` = 780
WHERE `users`.`id` IN ('41')

    // -----------------------------
    // ADD BUYER SHARE
    // -----------------------------
    $userModel->update($userId, [
        'wallet' => $user['wallet'] + $userShare
    ]);
---
UPDATE `users` SET `wallet` = 1330
WHERE `users`.`id` IN ('42')

    // -----------------------------
    // REDUCE STOCK SAFELY
    // -----------------------------
    $db->table('tickets')
        ->where('id', $ticketId)
        ->set('qty', 'qty - 1', false)
        ->update();
---
UPDATE `tickets` SET `qty` = qty - 1
WHERE `id` = 6

    // -----------------------------
    // SAVE PURCHASE
    // -----------------------------
    $db->table('purchases')->insert([
        'user_id'    => $userId,
        'ticket_id'  => $ticketId,
        'price'      => $amount,
        'created_at' => date('Y-m-d H:i:s')
    ]);
---
INSERT INTO `purchases` (`user_id`, `ticket_id`, `price`, `created_at`) VALUES ('42', 6, 150, '2026-03-08 06:03:47')

public function profile()
{
    if (!session()->get('logged')) {
        return redirect()->to('/login');
    }

    $userModel = new UserModel();
    $db        = \Config\Database::connect();

    $userId = session()->get('id');

    // Get user
    $user = $userModel->find($userId);

    if (!$user) {
        session()->destroy();
        return redirect()->to('/login')->with('error','User not found.');
    }

    // -----------------------
    // PURCHASES
    // -----------------------
    $purchases = $db->table('purchases')
        ->select('purchases.*, tickets.title, tickets.image, tickets.event_date')
        ->join('tickets', 'tickets.id = purchases.ticket_id')
        ->where('purchases.user_id', $userId)
        ->orderBy('purchases.id','DESC')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '42'
SELECT `purchases`.*, `tickets`.`title`, `tickets`.`image`, `tickets`.`event_date`
FROM `purchases`
JOIN `tickets` ON `tickets`.`id` = `purchases`.`ticket_id`
WHERE `purchases`.`user_id` = '42'
ORDER BY `purchases`.`id` DESC

    // -----------------------
    // COMMISSIONS
    // -----------------------
  $commissions = $db->table('commissions')
    ->select('commissions.*, users.name as from_user, tickets.title as ticket_title, tickets.image as ticket_image')
    ->join('users','users.id = commissions.from_user_id')
    ->join('purchases','purchases.user_id = commissions.from_user_id','left')
    ->join('tickets','tickets.id = purchases.ticket_id','left')
    ->where('commissions.sponsor_id', $userId)
    ->orderBy('commissions.id','DESC')
    ->get()
    ->getResultArray();
---
SELECT `commissions`.*, `users`.`name` as `from_user`, `tickets`.`title` as `ticket_title`
FROM `commissions`
JOIN `users` ON `users`.`id` = `commissions`.`from_user_id`
LEFT JOIN `purchases` ON `purchases`.`user_id` = `commissions`.`from_user_id`
LEFT JOIN `tickets` ON `tickets`.`id` = `purchases`.`ticket_id`
WHERE `commissions`.`sponsor_id` = '42'
ORDER BY `commissions`.`id` DESC